import {
  HtmlCss,
  Way,
  CssGrid,
  FlexBox,
  MediaQuery,
  Sass,
  Bem,
  Bootstrap,
  Pro1,
  Js,
  Js2,
  React,
} from "../assets/courses";

export const courses = [
  {
    title: "مسیر کامل یادگیری طراحی وب",
    image: Way,
    link: "https://toplearn.com/courses/web-design/%D9%85%D8%B3%DB%8C%D8%B1-%DA%A9%D8%A7%D9%85%D9%84-%DB%8C%D8%A7%D8%AF%DA%AF%DB%8C%D8%B1%DB%8C-%D8%B7%D8%B1%D8%A7%D8%AD%DB%8C-%D9%88%D8%A8",
    info: "امروزه یکی از دغدغه های هر فرد برای شروع یه مهارت و تخصص جدید راه و مسیر شروع هست که توسط یه مقاله یا یک دوره کوتاهی میتونه اینو بدست بیاره",
  },
  {
    title: "دوره جامع آموزش html & css",
    image: HtmlCss,
    link: "https://toplearn.com/courses/web-design/%D8%A2%D9%85%D9%88%D8%B2%D8%B4-%D8%B1%D8%A7%DB%8C%DA%AF%D8%A7%D9%86-Html-%D9%88-Css",
    info: `در‌ این دوره قصد داریم‌ به صورت کامل به یادگیری html و همچنین css بپردازیم تا حد امکان سعی میشه در این دوره از مثال های کوچک و کاربردی استفاده شود تا مطالب به صورت کامل برای شما عزیزان قابل فهم باشه این دوره درواقع سطح پیشرفته تر و کامل تر  برای دوره html & css از مقدماتی میباشد و در انتهای این دوره شما میتونید با گذراندن دوره html & css پیشرفته به نوشتن سه پروژه کامل بپردازید و مطالبی که در‌این دوره یادگرفتید را مورد استفاده قرار دهید`,
  },
  {
    title: "آموزش CSS Grid",
    image: CssGrid,
    link: "https://toplearn.com/courses/web-design/%D8%A2%D9%85%D9%88%D8%B2%D8%B4-CSS-Grid",
    info: "گرید یک سیستم صفحه آرایی دو بعدی است که برای رفع مشکلات صفحه آرایی در طراحی واسط کاربری ساخته شده است.",
  },
  {
    title: "دوره آموزش FlexBox",
    image: FlexBox,
    link: "https://toplearn.com/courses/web-design/%D8%AF%D9%88%D8%B1%D9%87-%D8%B1%D8%A7%DB%8C%DA%AF%D8%A7%D9%86-%D8%A2%D9%85%D9%88%D8%B2%D8%B4-FlexBox",
    info: "مفهوم فلکس باکس (FlexBox) یا Flexible Box یک مدل برای لایه بندی صفحات وب در طراحی سایت می باشد که به شما کمک میکند بدون استفاده از float و یا  positioning  به طراحی صفحات انعطاف پذیر و در نهایت واکنشگرا بپردازید اگر با لایه بندی صفحات  آشنا باشید حتما با ایرادات موجود در ویژگی  float که به کمک خاصیت  clearfix حل می شود مواجه شده اید",
  },
  {
    title: "آموزش Media Query در Css",
    image: MediaQuery,
    link: "https://toplearn.com/courses/web-design/%D8%A2%D9%85%D9%88%D8%B2%D8%B4-Media-Query-%D8%AF%D8%B1-Css",
    info: "یکی از مباحث مهم در طراحی وب واکنشگرا بودن وبسایت ها هست یعنی ما بتونیم قالبی رو طراحی کنیم که در پلتفرم های مختلف قابل نمایش باشن و به صورت خیلی مرتب عناصر صفحه نمایش داده بشنبرای حل این موضوع مبحثی در Css وجود داره به اسم Media Query که ما میتونیم توسط این در سایز های مشخصی در وبسایت خودمون تغییراتی ایجاد کنیم",
  },
  {
    title: "آموزش Sass به همراه پروژه عملی",
    image: Sass,
    link: "https://toplearn.com/courses/web-design/%D8%A2%D9%85%D9%88%D8%B2%D8%B4-%D8%B1%D8%A7%DB%8C%DA%AF%D8%A7%D9%86-Sass",
    info: "Sass یک زبان Stylesheet است که به CSS کامپایل شده و به شما اجازه میدهد از variable ها ،  nested rule ها ، mixin ها و function ها در استایل دهی خود استفاده کنیدSass به شما کمک میکند تا Style های بسیار بزرگ و سنگین را به راحتی مدیریت کرده و به راحتی بتوانید از کدهای نوشته شده خود ، بارها و بارها در پروژه های مختلف استفاده کنید",
  },
  {
    title: "آموزش روش BEM برای نامگذاری کلاس ها",
    image: Bem,
    link: "https://toplearn.com/courses/web-design/%D8%A2%D9%85%D9%88%D8%B2%D8%B4-%D8%B1%D9%88%D8%B4-BEM-%D8%A8%D8%B1%D8%A7%DB%8C-%D9%86%D8%A7%D9%85%DA%AF%D8%B0%D8%A7%D8%B1%DB%8C-%DA%A9%D9%84%D8%A7%D8%B3-%D9%87%D8%A7",
    info: "یکی از مشکلاتی که در پروژه های طراحی وب دیده میشه نامگذاری کلاس ها هست یا به اصطلاح نامگذاری معنی دار و اصولی .روش های خیلی زیادی برای نامگذاری کلاس ها داریم که یکی از روش ها BEM هست Block Element Modifier",
  },
  {
    title: "آموزش بوت استرپ (BootStrap)",
    image: Bootstrap,
    link: "https://toplearn.com/courses/web-design/%D8%A2%D9%85%D9%88%D8%B2%D8%B4-%D8%A8%D9%88%D8%AA-%D8%A7%D8%B3%D8%AA%D8%B1%D9%BE-(BootStrap)",
    info: "Bootstrap مجموعه ای از ابزارهای رایگان برای ایجاد صفحات وب و نرم افزارهای تحت وب است که شامل دستورات HTML، CSS و توابع جاوا اسکریپت جهت تولید و نمایش فرم ها، دکمه ها، تب ها، ستون ها و سایر المان های مورد نیاز طراحی وب می باشد.",
  },
  {
    title: "دوره آموزش طراحی سایت پروژه محور",
    image: Pro1,
    link: "https://toplearn.com/courses/web-design/%D8%AF%D9%88%D8%B1%D9%87-%D8%A2%D9%85%D9%88%D8%B2%D8%B4-%D8%B7%D8%B1%D8%A7%D8%AD%DB%8C-%D8%B3%D8%A7%DB%8C%D8%AA-%D9%BE%D8%B1%D9%88%DA%98%D9%87-%D9%85%D8%AD%D9%88%D8%B1",
    info: "Bootstrap مجموعه ای از ابزارهای رایگان برای ایجاد صفحات وب و نرم افزارهای تحت وب است که شامل دستورات HTML، CSS و توابع جاوا اسکریپت جهت تولید و نمایش فرم ها، دکمه ها، تب ها، ستون ها و سایر المان های مورد نیاز طراحی وب می باشد.",
  },
  {
    title: "دوره آموزش جامع JavaScript از 0 تا 100",
    image: Js,
    link: "https://toplearn.com/courses/web-design/%D8%A2%D9%85%D9%88%D8%B2%D8%B4-%D9%85%D9%82%D8%AF%D9%85%D8%A7%D8%AA%DB%8C-%D8%AA%D8%A7-%D9%BE%DB%8C%D8%B4%D8%B1%D9%81%D8%AA%D9%87-%D8%AC%D8%A7%D9%88%D8%A7-%D8%A7%D8%B3%DA%A9%D8%B1%DB%8C%D9%BE%D8%AA",
    info: "جاوا اسکریپت یکی از مهم‌ترین زبان‌های برنامه‌نویسی حوزه‌ی وب محسوب می‌شود. جاوا اسکریپت اولین بار با اسم LiveScript و توسط شرکت نت اسکیپ معرفی شد و بعدها به جاوا اسکریپت تغییر نام داد. البته جالب است بدانید جاوا اسکریپت نه از نظر ساختار و نه از نظر مفاهیم، شباهتی به زبان جاوا ندارد و این تشابه اسمی، در حد همان کلمات و نام و نشان باقی مانده است. ",
  },
  {
    title: "آموزش جاوا اسکریپت برای برنامه ‌نویسی فرم‌ های وب",
    image: Js2,
    link: "https://toplearn.com/courses/web-design/%D8%A2%D9%85%D9%88%D8%B2%D8%B4-%D8%AC%D8%A7%D9%88%D8%A7-%D8%A7%D8%B3%DA%A9%D8%B1%DB%8C%D9%BE%D8%AA-%D8%A8%D8%B1%D8%A7%DB%8C-%D8%A8%D8%B1%D9%86%D8%A7%D9%85%D9%87-%E2%80%8C%D9%86%D9%88%DB%8C%D8%B3%DB%8C-%D9%81%D8%B1%D9%85%E2%80%8C-%D9%87%D8%A7%DB%8C-%D9%88%D8%A8",
    info: "به احتمال زیاد، در بیشتر وب ‌سایت‌ها فرم ‌ها را دیده‌اید. در اغلب موارد فرم‌ ها بخش فعال وب‌ سایت هستند و نقش مهمی در جمع‌آوری اطلاعات کاربر دارند. اگر این فرم‌ ها به درستی طراحی نشوند حس ناخوشایندی را برای کاربر به همراه خواهند داشت.در این دوره روش‌های ساخت فرم ‌های کاربردی که داده‌ها را به خوبی جمع‌آوری می‌کند را خواهید آموخت. ",
  },
  {
    title: "آموزش صفر تا صد ReactJs",
    image: React,
    link: "https://toplearn.com/courses/web-design/%D8%A2%D9%85%D9%88%D8%B2%D8%B4-%D8%B5%D9%81%D8%B1-%D8%AA%D8%A7-%D8%B5%D8%AF-ReactJs",
    info: "امروزه ReactJs به سرعت در حال تبدیل شدن به یک ابزار بسیار قدرتمند برای ساخت وب اپلیکیشن ها است و خیلی از معروفترین سایت ها از جمله فیسبوک , توییتر, نتفلیکس , یاهو , اینستاگرام و غیره همه در حال استفاده از این ابزار بسیار قدرتمند برای هرچه سریعتر و کارآمدتر کردن سایت و وب اپلیکیشن های خود هستند.",
  },
];
